In [1]:
print(getwd()) # Lay va in thu muc hien hanh

[1] "D:/LDS7_PhanCungTien"

In [2]:
# thay doi duong dan hien hanh
# setwd(duong_dan)

In [9]:
# Doc file
#file text
content <- readLines("Du_lieu/license.txt")

In [10]:
content

[1] "These data files are derived by splitting up the data set downloaded from:"
[2] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[3] "under the Open Government License - Ontario:"
[4] "https://www.ontario.ca/page/open-government-licence-ontario"

In [11]:
# Voi tap tin tieng viet
content <- readLines("Du_lieu/bai_tho.txt", encoding="UTF-8")

In [12]:
content

[1] "<U+FEFF>Mùa xuân là T<U+1EBF>t tr<U+1ED3>ng cây"
[2] "Làm cho d<U+1EA5>t nu<U+1EDB>c càng ngày càng xuân"
[3] ""

In [13]:
nchar(content)

[1] 26 36  0

In [14]:
length(content)

[1] 3

In [15]:
# xem kich co file
file.size("Du_lieu/bai_tho.txt")

[1] 89

In [16]:
content1 <- scan("Du_lieu/license.txt","")

In [17]:
content1

 [1] "These"
 [2] "data"
 [3] "files"
 [4] "are"
 [5] "derived"
 [6] "by"
 [7] "splitting"
 [8] "up"
 [9] "the"
[10] "data"
[11] "set"
[12] "downloaded"
[13] "from:"
[14] "https://www.ontario.ca/data/ontario-public-schools-enrolment"
[15] "under"
[16] "the"
[17] "Open"
[18] "Government"
[19] "License"
[20] "-"
[21] "Ontario:"
[22] "https://www.ontario.ca/page/open-government-licence-ontario"

In [18]:
# Doc file co cau truc
df <- read.table("Du_lieu/Table0.txt")

In [19]:
df

  V1       V2 V3  V4 V5
1 Alex     25 177 57 F
2 Lilly    31 163 69 F
3 Mark     23 190 83 M
4 Oliver   52 179 75 M
5 Martha   76 163 70 F
6 Lucas    49 183 83 M
7 Caroline 26 164 53 F

In [21]:
content2 <- "Hello and welcome"
file_name = file(description="Du_lieu/text.txt", open="a", encoding="UTF-8")
write(content2, file=file_name)
content2 <-readLines("Du_lieu/text.txt")
content2

[1] "Hello and welcome" "Hello and welcome" "Hello and welcome"
[4] "Hello and welcome"

In [22]:
# doc file csv
data <- read.csv("Du_lieu/emp.csv")

In [23]:
data

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
2  2 Dan      515.20 2013-09-23 Operations
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
6  6 Nina     578.00 2013-05-21 IT
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [28]:
retval <- subset(data, salary > 600)
retval

  id name     salary start_date dept
1  1 Rick     623.30 2012-01-01 IT
3  3 Michelle 611.00 2014-11-15 IT
4  4 Ryan     729.00 2014-05-11 HR
5 NA Gary     843.25 2015-03-27 Finance
7  7 Simon    632.80 2013-07-30 Operations
8  8 Guru     722.50 2014-06-17 Finance

In [30]:
#Ghi file
it_emps = subset(data, dept =='IT')
#ghi file
write.csv(it_emps, "Du_lieu/it_emps.csv", row.names = FALSE)

In [32]:
newdata = read.csv("Du_lieu/it_emps.csv")

In [33]:
newdata

  id name     salary start_date dept
1 1  Rick     623.3  2012-01-01 IT
2 3  Michelle 611.0  2014-11-15 IT
3 6  Nina     578.0  2013-05-21 IT

In [35]:
# Excel
library("xlsx") #load library

In [36]:
data <- read.xlsx("Du_lieu/emp_data.xlsx", sheetIndex =1)
data

  id name     salary start_date dept
1 1  Rick     623.30 2012-01-01 IT
2 2  Dan      515.20 2013-09-23 Operations
3 3  Michelle 611.00 2014-11-15 IT
4 4  Ryan     729.00 2014-05-11 HR
5    Gary     843.25 2015-03-27 Finance
6 6  Nina     578.00 2013-05-21 IT
7 7  Simon    632.80 2013-07-30 Operations
8 8  Guru     722.50 2014-06-17 Finance

In [37]:
data <- read.xlsx("Du_lieu/emp_data.xlsx", sheetName ='city')
data

  name     city
1 Rick     Seattle
2 Dan      Tampa
3 Michelle Chicago
4 Ryan     Seattle
5 Gary     Houston
6 Nina     Boston
7 Simon    Mumbai
8 Guru     Dallas

In [ ]:
write.xlsx(retval, file="Du_lieu/emp_data.xlsx", sheetName="Sheet1")